give @s red_dye[item_name="テストアーティファクト",\
custom_data={\
  1:10,\
  2:0,\
  3:0,\
  4:50,\
  5:0,\
  6:5,\
  7:20,\
  8:0\
}] 1

give @s red_dye[item_name="インチキ攻撃力のアーティファクト",custom_data={\
  1:100,\
  2:0,\
  3:0,\
  4:0,\
  5:0,\
  6:0,\
  7:0,\
  8:0\
}] 1
give @s red_dye[item_name="インチキ魔力のアーティファクト",custom_data={\
  1:0,\
  2:0,\
  3:0,\
  4:100,\
  5:0,\
  6:0,\
  7:0,\
  8:0\
}] 1
give @s red_dye[item_name="確定会心のアーティファクト",custom_data={\
  1:0,\
  2:0,\
  3:0,\
  4:0,\
  5:0,\
  6:0,\
  7:100,\
  8:0\
}] 1
give @s red_dye[item_name="インチキ会心倍率強化のアーティファクト",custom_data={\
  1:0,\
  2:0,\
  3:0,\
  4:0,\
  5:0,\
  6:0,\
  7:0,\
  8:100\
}] 1